; TaskSwitchXP Pro 2.05 English Language File (Template)
; Translated by Alexander Avdonin <alexander@ntwind.com>

;##############################################################################
; Changes for version 2.06 (May 16, 2005)
; Added strings:
;   => 20111="Add minimized to tray windows to the end of Alt-Tab list"
;##############################################################################


;##############################################################################
; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.
;##############################################################################


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="Hebrew (Ivrit)"


; Cofiguration
20000="TaskSwitchXP Pro 2.0 הגדרות"
20001="המשך"
20002="ביטול"
20003="ישם"

; Filters
20031="TaskSwitchXP Configuration Files (*.cfg)"


; Pages
20050="כללי"
20051="תצוגה"
20052="רשימת משימות"
20053="תצוגה מקדימה"
20054="מידע משימה"
20055="מקשים חמים"
20056="חריגים"
20057="מתקדם"
20058="אודות"

; Page descriptions
20070="הגדרות כלליות"
20071="הגדרות תצוגה"
20072="רשימת משימות"
20073="הגדרות תצוגה מקדימה"
20074="מידע משימה"
20075="מקשים חמים"
20076="TaskSwitchXP חריגי"
20077="הגדרות מתקדמות"
20078="TaskSwitchXP מידע על"


; General page
20100="שפה:"
20101="<a id=\"idLang\" href=\"\">...מצא עוד תרגומים</a>"
20102="השתמש בהגדרות שונות עבור כל משתמש במערכת"
20103="אתחל מיד עם עלית המערכת"
20104="TaskSwitchXP הגדר עדיפות עליונה עבור"
20105="רץ PowerToy TaskSwitcher בדוק האם"
20106="צלמיות מגש משימות:"
20107="במגש המערכת בהפעלה TaskSwitchXP הראה צלמית"
20108=":השתמש בצלמית אישית"
20109="מזער חלונות למגש המערכת עם לחיצה על כפתור המזעור"
20110="שמור את צלמית התוכנה בפני תכונת הסתרה אוטומטית"
20111="הוסף חלונות שמוזערו לשורת המשימות בסוף רשימת החלונות"

20120="החזר לברירת המחדל"
20121="...הטען"
20122="...שמור"

; Appearance page
20200=":מיקום על המסך"
20201="הראה על מסך נוכחי"
20202=":TaskSwitchXP הצלל את חלון"
20203=":TaskSwitchXP אפשר שקיפות בחלון"
20204=":(אפשר עמעום הנפשה (במילישניות"
20205=":(אפשר עמעום ביציאה מהנפשה (במילישניות"
20206=":אפשרויות תצוגה מועדפות"
20207=":XP סגנון חזותי"
20208=":סגנון קלאסי"
20209="בסגנון קלאסי TaskSwitchXP כפה שימוש של"
20210="סדר חלון משמאל לימין"

; Position on screen
20270="למעלה משמאל"
20271="למעלה במרכז"
20272="למעלה מימין"
20273="במרכז משמאל"
20274="ממורכז"
20275="במרכז מימין"
20276="למטה משמאל"
20277="למטה באמצע"
20278="למטה מימין"

; Modern XP skins
20280="Start Panel style (default)"
20281="PowerToy TaskSwitcher style"
20282="Simple Window style"
20283="Flat XP style"
20284="Soft XP style"
20285="TaskBar style"

; Classical skins
20290="Start Panel style (default)"
20291="Flat Start Panel style"


; Task List page
20300=": מראה הרשימה"
20301=": מספר עמודות"
20302="(רוחב (בפיקסלים=:"
20303="מספר שורות:"
20304="צלמיות קטנות"
20305="אפשר עזרה ברשימת הצלמיות"
20306="הראה סימן יד על פריט מהרשימה"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="אפשר בחירה מהרשימה עם העכבר"
20308="הפוך גלגל עכבר"
20309=": סגנון בחירה"
20310="צייר ריבוע פוקוס"
20311=": טקסט - סגנון וצבעים"
20312=": אות"
20313=": גודל"
20314="B"
20315="I"
20316="צבע:"

; List views
20390="צלמיות"
20391="רשימה אנכית"

; Selection styles
20380="מסגרת"
20381="ריבוע מלא"
20382="ריבוע מעוגל"

; Color indexes
20370="טקסט רגיל"
20371="טקסט שנבחר"
20372="רקע שנבחר"
20373="1 טקסט מסומן"
20374="1 רקע מסומן"
20375="2 טקסט מסומן"
20376="2 רקע מסומן"


; Preview page
20400=": סגנון תצוגה מקדימה"
20401="\"Desktop\" סגנון תצוגה מקדימה"
20402="\"Window\" סגנון תצוגה מקדימה"
20403="כלול את שורת המשימות בתצוגה המקדימה"
20404="צייר רק את החלון הקופף האחרון של היישום"
20405="(אל תצייר את רקע שולחן העבודה בתצוגה במקדימה (סגנון ישן"
20406="צייר את טפט שולחן העבודה כרקע התצוגה המקדימה"
20407="צייר גבול מסביב לתמונת התצוגה במקדימה"
20408="מרכז אנכית את התצוגה המקדימה"
20409="(*) הראה כותרות חלונות ממוזערים בתצוגה המקדימה"
20410="(*) הוצא חלונות שקופים מהתצוגה המקדימה"
20411=":(רוחב התצוגה המקדימה (בפיקסלים"
20412=":(עיכוב יצירת התמונה המקימה הראשונית (במילישניות"
20413="אל תשמור בזיכרון מטמון את תמונות התצוגה המקדימה"
20414=":(אפשר עדכון חי בתצוגה המקדימה (במילישניות"


; Info page
20500=": כותרת החלון"
20501=": אות"
20502=": גודל"
20503="B"
20504="I"
20505=": צבע"
20506=": צייר צל"
20507=": עומק"
20508=": צבע"
20509="הראה צלמית יישום בכותרת החלון"
20510="השתמש בצלמיות כותרת קטנות"
20511=": חלון המידע"
20512=": אות"
20513=": גודל"
20514="B"
20515="I"
20516=": צבע"
20517=": צייר צל"
20518="עומק :"
20519="צבע :"
20520=": גובה"
20521="תבנית :"

; Info formats
20590="ללא"
20591="מספר משימה בלבד"
20592="תז תהליך"
20593="שם תהליך"
20594="[PID] שם תהליך"
20595="תיאור תוכנית"


; Hotkeys page
20600="החלף את מחליף התוכניות הסטנדרטי של מערכת חלונות"
20601="ALT- עם שחרור מקש ה  TASKSWITCHXP אל תעלים את	"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Alt-Tab אפשר מצב דביק במקשי"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Use low-level keyboard hook to replace Alt-Tab"
20604=": TaskSwitchXP שליטה ב"
20605="רשימת יישומים:"
20606="רשימת בנים:"
20607="TaskSwitchXP הגדרת:"
20608="הראה/הסתר צלמית בסל המשימות:"
20609="TaskSwitchXP צא מ:"
20610="מקשים חמים נוספים:"
20611="מזער לשורת המשימות:"
20612="שחזר ממגש המערכת:"


; Exclusions page
20700="...חדש"
20701="...ערוך"
20702="סגור"

; List groups
20780="ציור תצוגה מקדימה"
20781="ספירת חלונות"

20790="שם"
20791="מאפיינים"

; Advanced page
20800=":כותרות החלון"
20801="השתמש בכותרת החלון הראשי של היישום"
20802=": הגדרות ממשק משתמש מתקדמות"
20803="הסר חלון כותרות"
20804="הסר חלון מידע"
20805=": פעולות מגש המשימות"
20806=": תפריט ימני"
20807=": הגדרות"
20808=": רשימת יישומים"
20809=": רשימת בנים"
20810=": הגדרות המגדיר"
20811="הראה את חלון ההגדרות תמיד מעל"
20812="זכור את מיקום חלון ההגדרות"
20813="זכור את דף ההגדרות האחרון"
20814="בעליה TaskSwitchXP אתחל את"

; Tray icon actions
20890="ללא"
20891="לחצן עכבר שמאלי"
20892="לחיצה כפולה בלחצן שמאלי"
20893="לחצן עכבר אמצעי"
20894="לחיצה כפולה בלחצן אמצעי"
20895="לחצן עכבר ימני"
20896="לחיצנ כפולה בלחצן ימני"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Translated by <a id=\"idTranslatorMail\" href=\"mailto:nachoum@hotmail.co.il\">Nachoum Abramovitch</a>...\r From Israel - In God we trust"


; Exclusions dialog
22000="TaskSwitchXP חריגים של"
22001="קבל"
22002="בטל"
22003=": יישומים פעילים"
22004="עדכן"
22005="שם החריג:"
22006="הוחרג על ידי:"
22007="שם התהליך:"
22008="כיתת החלון:"
22009="כותרת החלון:"
22010="הוחרג מ:"
22011="ציור תצוגה מקדימה"
22012="ספירת החלון"
22013="אפשר"

22090="" ; not excluded
22091=">> הוחרג מתצוגה מקדימה"
22092=">> הוחרג מספירת החלונות"

; Configurator Errors
30000="TaskSwitchXP טעות בהגדרת"
30002="בדוק את התקנה TaskSwitchXP.exe! לא מסוגל לאתחל את"
30003="אין אפשרות לשמור את ההגדרות לרגיסטרי. בדוק את ההרשאות שלך"
30004="לא מצליח לטעון את ההגדרות מהקובץ"
30005="לא מצליח לטעון את ההגדרות מהקובץ. שוחזרו הגדרות ברירת המחדל"
30006="לא מצליח לשמור הגדרות לקובץ"

; Hints for exclusion dialog
30100="חריג ללא שם"
30101="אנא הגדר שם לחריג"
30102="ללא משתנים"
30103="אנא הגדר מאפיינים לחריג"
30104="תהליך ללא שם"
30105="אנא הגדר שם לתהליך"
30106="ללא כיתת חלון"
30107="אנא הגדר כית חלון"

; Confirmations
30900="TaskSwitchXP אישור"
30901="TaskSwitchXP has detected more than one display monitors are active in your system.\r\nDo you want to enable \"Window\" preview mode to show all previews from secondary monitor(s)?"


; TaskSwitchXP Language Strings

; Tray menu
31000="רשימת יישומים"
31001="רשימת בנים"	
31002="...הגדרות"
31003="יציאה"

31020="הגדרות מהירות"
31021="הסתר צלמית מגש מערכת"
31022="Alt-Tab החלף"
31023="אפשר החלפת בנים"
31024="Alt-Tab אפשר מצב דביק למקשי"
31025="Use low-level keyboard hook"
31026="...חריג חדש"

31050="עזרה"
31051="מסמכים"
31052="דף הבית"
31053="TaskSwitchXP אודות"

; Tray menu for minimized applications
31090="TSXP: %d app(s)"
31091="שחזר הכל"
31092="מזער הכל"
31093="סגור הכל"
31094="שחזר"
31095="מזער"
31096="סגור"

; Task List menu
31110="...עבור ל"
31111="מזער"
31112="מזער למגש המשימות"
31113="צורת מפל"
31114="סדר אופקית"
31115="סדר אנכית"
31116="שחזר"
31117="הדגל"
31118="סגור"
31119="סיים תהליך"

; Common menu
31150="הראה מידע תהליך"
31151="בחר הכל"
31152="הסר בחירה"
31153="הסר את הנבחרים"
31154="מיין לפי כותרת"
31155="מיין לפי יישום"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Image Name:  %s\r\nProcess ID:  %u\r\n\r\nDuration:  %u:%02u:%02u\r\nCPU Time:  %u:%02u:%02u\r\n\r\nMem Usage:  %uK\r\nVM Size:  %uK"
31501="N/A" ; Process information is not available...

; Confirmations
31900="TaskSwitchXP אישור"
31901=" רץ . האם ברצונך לצאתTaskSwitchXP ?"
31902="TaskSwitchXP? האם את בטוח שברצונך לצאת מ"
31903="TaskSwitchXP has detected Ms PowerToy TaskSwitcher is running.\r\n? האם ברצונך לעצור אותו"

; Errors
32000="TaskSwitchXP טעות"
32002=".האתחול נכשל"
32003="Could not install low level keyboard hook."
32004="Could not register hot key Alt+Tab or Alt+Shift+Tab.\r\nAnother application may have already registered it."
32005="Could not register hot key Ctrl+Alt+Tab or Ctrl+Alt+Shift+Tab.\r\nAnother application may have already registered it."
32006="בדוק את התקנה TaskSwitchXP.exe! לא מסוגל לאתחל את"

32500="Could not register hot key:\r\n\r\nName: %s\r\nModifiers: %02X\r\nVirtual Code: %02X"
32501="TaskSwitchXP צא מ"
32502="הראה/הסתר סמל שורת משימות"
32503="TaskSwitchXP הגדר"
32504="רשימת יישומים"
32505="רשימת בנים"
32506="מזער חלון למגש המערכת"
32507="שחזר ממגש המערכת"
